uhnp/src/DataProcessors/тн_СверкаДанных_УУБУ_УПП_ERP/тн_СверкаДанных_УУБУ_УПП_ERP.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>тн_СверкаДанных_УУБУ_УПП_ERP</name>
  <comment>//Сафиуллина З.Р. 16.12.2025 Выполнение задач №000055692</comment>
</mdclass:DataProcessor>

uhnp/src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Хозрасчетный</name>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоПодразделениям</accountingFlag>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоНаправлениямДеятельности</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаНУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаПР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаВР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаУУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаФО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеКорректироватьСтоимостьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

uhnp/src/Catalogs/Партнеры/Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Партнеры</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>НашеПредприятие</name>
      <description>Наше предприятие</description>
    </items>
    <items>
      <name>НеизвестныйПартнер</name>
      <description>Неизвестный партнер</description>
    </items>
    <items>
      <name>РозничныйПокупатель</name>
      <description>Розничный покупатель</description>
    </items>
  </predefined>
  <attributes>
    <name>БизнесРегион</name>
    <comment>Используется для группировки по территориальному признаку</comment>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <comment>Используется при анализе первичного интереса</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <comment>Клиенты</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <comment>Поставщики</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Публичное наименование, например, для печати или устного обращения.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <comment>Конкуренты</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <comment>Прочие отношения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбслуживаетсяТорговымиПредставителями</name>
    <comment>Обслуживаются торговыми представителями</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <comment>Перевозчики</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <type>
      <types>CatalogRef.ШаблоныЭтикетокИЦенников</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.КомпанияЧастноеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПереработчика</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОтправкиЭлектронногоЧека</name>
    <type>
      <types>EnumRef.ВариантыОтправкиЭлектронногоЧекаПокупателю</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаДоставки</name>
    <type>
      <types>CatalogRef.ЗоныДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндивидуальныйВидЦены</name>
    <comment>Уточняющий или индивидуальный вид цены</comment>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_ЯвляетсяОбъектомЦБ</name>
    <comment>Выполнение задач №000042800</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_РаботаетСЭД</name>
    <comment>// Шичкин Егор 15.12.2022 Выполнение задач №000043264</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_Контрагент</name>
    <comment>//Блинова М.А. 14.11.2024 Выполнение задач №000051645</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/DataProcessors/тн_СверкаДанных_УУБУ_УПП_ERP/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Взаиморасчеты
	СписокЗначенийДоступныхСчетов_Взаиморасчеты = Новый СписокЗначений;
	СписокЗначенийДоступныхСчетов_Взаиморасчеты.ЗагрузитьЗначения(СписокДоступныхСчетов_Взаиморасчеты());
	Взаиморасчеты_СчетаБУ.ДоступныеЗначения = СписокЗначенийДоступныхСчетов_Взаиморасчеты;; 
	
	ИнициализироватьКомпоновкуДанных();
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)  
	
	УстановитьВидимостьДоступность(); 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы  

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеВыборФайла", ЭтаФорма);
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Фильтр = "(*.xlsx)|*.xlsx";
	ДиалогВыбораФайла.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВыборФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если Не ВыбранныеФайлы = Неопределено Тогда
		ПутьКФайлу = ВыбранныеФайлы[0];	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантСверкиПриИзменении(Элемент) 
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПровестиСверку(Команда) 
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(ПутьКФайлу) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо выбрать файл, выгруженный из УПП!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВариантСверки) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо выбрать вариант сверки!"); 
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаСверки) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо указать дату сверки!");
		Возврат;
	КонецЕсли;
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлу);
	АдресХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
	ПровестиСверкуНаСервере(АдресХранилища);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТабДок(Команда)
	ОбновитьТабДокНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийРасшифровкиРезультата

&НаКлиенте
Процедура ТабличныйДокументРезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьЗначениеРасшифровки(Расшифровка, Элемент.ТекущаяОбласть.Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗначениеРасшифровки(Расшифровка, ТекстовоеЗначениеПоля)
	
	//НАЧАЛО Качикина 27.04.2026 Выполнение задач №000057272
	//ЗначениеРасшифровки = ПолучитьЗначениеРасшифровкиПоДаннымРасшифровки(Расшифровка, ТекстовоеЗначениеПоля);
	//Если ЗначениеРасшифровки <> Неопределено Тогда
	//	ПоказатьЗначение(,ЗначениеРасшифровки);
	//КонецЕсли;
	
	СтруктураРасшифровки = ПолучитьЗначениеРасшифровкиПоДаннымРасшифровки(Расшифровка, ТекстовоеЗначениеПоля);
	ЗначениеРасшифровки	 = СтруктураРасшифровки.ЗначениеРасшифровки;
	
	Если СтруктураРасшифровки.Действие = "РасшифровкаАнализСубконто" Тогда
		РасшифровкаАнализСубконто(ЗначениеРасшифровки);		
	Иначе 
		Если ЗначениеРасшифровки <> Неопределено Тогда   
			ПоказатьЗначение(,ЗначениеРасшифровки);
		КонецЕсли; 
	КонецЕсли;
	//КОНЕЦ Качикина 27.04.2026 Выполнение задач №000057272
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеРасшифровкиПоДаннымРасшифровки(Расшифровка, ТекстПоляРасшифровки)
	
	//НАЧАЛО Качикина 27.04.2026 Выполнение задач №000057272 
	СтруктураРасшифровки = Новый Структура("Действие, ЗначениеРасшифровки", Неопределено, Неопределено);
	//КОНЕЦ Качикина 27.04.2026 Выполнение задач №000057272
	СсылкаРасшифровки = Неопределено;
	
	ДанныеРасшифровкиСверки = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	Если ТипЗнч(ДанныеРасшифровкиСверки) = Тип("ДанныеРасшифровкиКомпоновкиДанных")
		И Число(Расшифровка) <= ДанныеРасшифровкиСверки.Элементы.Количество() - 1 
		И ТипЗнч(ДанныеРасшифровкиСверки.Элементы[Расшифровка]) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля")
		//НАЧАЛО Качикина 27.04.2026 Выполнение задач №000057272
		//И ДанныеРасшифровкиСверки.Элементы[Расшифровка].ОсновноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
		Тогда 
		
		Если  ДанныеРасшифровкиСверки.Элементы[Расшифровка].ОсновноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
		//КОНЕЦ Качикина 27.04.2026 Выполнение задач №000057272
			МассивЗначений = ДанныеРасшифровкиСверки.Элементы[Расшифровка].ПолучитьПоля();
			Если МассивЗначений.Количество() > 0 И Строка(МассивЗначений[0].Значение) = ТекстПоляРасшифровки Тогда
				СсылкаРасшифровки = МассивЗначений[0].Значение;		
			КонецЕсли; 
		//НАЧАЛО Качикина 27.04.2026 Выполнение задач №000057272  
		СтруктураРасшифровки.ЗначениеРасшифровки = СсылкаРасшифровки;
		
		Иначе 
			
			МассивЗначений = ДанныеРасшифровкиСверки.Элементы[Расшифровка].ПолучитьПоля();
			
			НайденноеПоле = Неопределено;
			МассивПолейРасшифровки = Новый Массив; //доступные для расшифровки ресурсы
			МассивПолейРасшифровки.Добавить("СальдоДтБУ");
			МассивПолейРасшифровки.Добавить("СальдоКтБУ");
			МассивПолейРасшифровки.Добавить("СальдоДтВалБУ");
			МассивПолейРасшифровки.Добавить("СальдоКтВалБУ");
			Для Каждого ИмяПоля Из МассивПолейРасшифровки Цикл 
				НайденноеПоле = МассивЗначений.Найти(ИмяПоля);
				Если НайденноеПоле <> Неопределено Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если НайденноеПоле <> Неопределено Тогда
				
				МассивГруппировокОтборов = Новый Массив; //доступные для расшифровки группировки
				МассивГруппировокОтборов.Добавить("Контрагент");
				МассивГруппировокОтборов.Добавить("Договор"); 
				
				МассивГруппировок = ТиповыеОтчетыУХ.ПолучитьМассивПолейРасшифровки(Расшифровка, ДанныеРасшифровки);	
				ЗначениеРасшифровки = Новый Массив;
				Для Каждого ПолеРасшифровки Из МассивГруппировок Цикл
					Если МассивГруппировокОтборов.Найти(ПолеРасшифровки.Поле)<>Неопределено Тогда
						ЗначениеРасшифровки.Добавить(Новый Структура("Поле, Значение", ПолеРасшифровки.Поле, ПолеРасшифровки.Значение));
					КонецЕсли;
				КонецЦикла;
				
				Если ЗначениеРасшифровки.Количество()>0 Тогда
					СтруктураРасшифровки.Действие  = "РасшифровкаАнализСубконто";
					СтруктураРасшифровки.ЗначениеРасшифровки = ЗначениеРасшифровки;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		//КОНЕЦ Качикина 27.04.2026 Выполнение задач №000057272	
	КонецЕсли; 
	
	//НАЧАЛО Качикина 27.04.2026 Выполнение задач №000057272
	//Возврат СсылкаРасшифровки;
	Возврат СтруктураРасшифровки;
	//КОНЕЦ Качикина 27.04.2026 Выполнение задач №000057272
	
КонецФункции

//Качикина 27.04.2026 Выполнение задач №000057272   
&НаКлиенте
Процедура РасшифровкаАнализСубконто(ЗначениеОтбора)
	    		
    ПользовательскиеНастройки = Новый ПользовательскиеНастройкиКомпоновкиДанных; 
	
    ДополнительныеСвойства = ПользовательскиеНастройки.ДополнительныеСвойства;
    ДополнительныеСвойства.Вставить("РежимРасшифровки", Истина);
    ДополнительныеСвойства.Вставить("НачалоПериода",    НачалоМесяца(ДатаСверки));
    ДополнительныеСвойства.Вставить("КонецПериода",     КонецДня(ДатаСверки));
	ДополнительныеСвойства.Вставить("ПоСубсчетам",		Истина);
	ДополнительныеСвойства.Вставить("ЕстьВалюта",		Истина);                 
	ДополнительныеСвойства.Вставить("ПоказательБУ",		Истина);
	//ДополнительныеСвойства.Вставить("РазвернутоеСальдо",Истина);
	
	//ВидыСубконто >>>>>
	СписокВидовСубконто = Новый СписокЗначений;
    СписокВидовСубконто.Добавить(ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты"));
	СписокВидовСубконто.Добавить(ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры"));
	
	ДополнительныеСвойства.Вставить("СписокВидовСубконто", СписокВидовСубконто);
	//ВидыСубконто >>>>>
	
	//Группировки >>>>> 
	ГруппировкаОтчета = Новый Массив;
	
	ГруппировкаКонтрагент = Новый Структура;
	ГруппировкаКонтрагент.Вставить("Использование",  Истина);
	ГруппировкаКонтрагент.Вставить("Поле",           Новый ПолеКомпоновкиДанных("Субконто1"));
	ГруппировкаКонтрагент.Вставить("Представление",  "Контрагенты");
	ГруппировкаКонтрагент.Вставить("ТипГруппировки", 0);
	ГруппировкаОтчета.Добавить(ГруппировкаКонтрагент); 
	
	ГруппировкаДоговор = Новый Структура;
	ГруппировкаДоговор.Вставить("Использование",  Истина);
	ГруппировкаДоговор.Вставить("Поле",           Новый ПолеКомпоновкиДанных("Субконто2"));
	ГруппировкаДоговор.Вставить("Представление",  "Договоры");
	ГруппировкаДоговор.Вставить("ТипГруппировки", 0);
	ГруппировкаОтчета.Добавить(ГруппировкаДоговор);

	ДополнительныеСвойства.Вставить("Группировка", ГруппировкаОтчета);  
	//Группировки <<<<<<  
	
	//Отборы >>>>>>>>>>>>>
	НастройкаОтбора = ПользовательскиеНастройки.Элементы.Добавить(Тип("ОтборКомпоновкиДанных"));
	НастройкаОтбора.ИдентификаторПользовательскойНастройки = "Отбор"; 
	Если ЗначениеЗаполнено(Взаиморасчеты_Организации) Тогда 
		//отдельно добавляем отбор на организацию, т.к. может быть задан список
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(НастройкаОтбора, "Организация", Взаиморасчеты_Организации, ВидСравненияКомпоновкиДанных.ВСписке);
	КонецЕсли;
	Если ЗначениеЗаполнено(Взаиморасчеты_СчетаБУ) Тогда 
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(НастройкаОтбора, "Счет", Взаиморасчеты_СчетаБУ, ВидСравненияКомпоновкиДанных.ВИерархии); 
	Иначе 
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(НастройкаОтбора, "Счет", Взаиморасчеты_СчетаБУ.ДоступныеЗначения, ВидСравненияКомпоновкиДанных.ВИерархии);
	КонецЕсли;
    
	Для Каждого ЭлементМассива Из ЗначениеОтбора Цикл
		Если ТипЗнч(ЭлементМассива) = Тип("Структура") Тогда
			Если ЭлементМассива.Поле = "Контрагент" Тогда
				БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(НастройкаОтбора, "Субконто1", ЭлементМассива.Значение, ВидСравненияКомпоновкиДанных.ВИерархии);	
			ИначеЕсли ЭлементМассива.Поле = "Договор" Тогда
            	БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(НастройкаОтбора, "Субконто2", ЭлементМассива.Значение, ВидСравненияКомпоновкиДанных.Равно);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	//Отборы <<<<<<<<<<<<
	
    ПараметрыОтчета = Новый Структура;
    ПараметрыОтчета.Вставить("РежимРасшифровки",            Истина);
    ПараметрыОтчета.Вставить("ВидРасшифровки",              2);
    ПараметрыОтчета.Вставить("ПользовательскиеНастройки",   ПользовательскиеНастройки);
    ПараметрыОтчета.Вставить("ЗаполняемыеНастройки",        Новый Структура("Показатели", Истина));
    ПараметрыОтчета.Вставить("СформироватьПриОткрытии",     Истина);
		
    ОткрытьФорму("Отчет.АнализСубконто.Форма.ФормаОтчета", ПараметрыОтчета, ЭтотОбъект, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбщиеСлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьКомпоновкуДанных()
	
	//Взаиморасчеты
	СКД 				= РеквизитФормыВЗначение("Объект").ПолучитьМакет("Взаиморасчеты_Результат");
	АдресВХ 			= ПоместитьВоВременноеХранилище(СКД, УникальныйИдентификатор);
	ИсточникНастроек 	= Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресВХ);
	Взаиморасчеты_КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	Взаиморасчеты_КомпоновщикНастроек.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступность() 
	
	Элементы.ГруппаОтборы_Взаиморасчеты.Видимость = ВариантСверки = "Взаиморасчеты";
	Элементы.ГруппаНастройкиВывода_Взаиморасчеты.Видимость = ВариантСверки = "Взаиморасчеты"; 
	Элементы.ГруппаРезультатСверки.Доступность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ПровестиСверкуНаСервере(АдресХранилища)
	
	Если ВариантСверки = "Взаиморасчеты" Тогда
		ВыполнитьСверкуНаСервере_Взаиморасчеты(АдресХранилища);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиОтчетНаФорму(ТаблицаСверки)
	
	ТабличныйДокументРезультат.Очистить();
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ИмяМакета = ВариантСверки + "_Результат";
	СхемаКомпоновкиДанных = ОбработкаОбъект.ПолучитьМакет(ИмяМакета);
	
	РеквизитКомпоновщик = ЭтотОбъект[ВариантСверки + "_КомпоновщикНастроек"];
	Настройки = РеквизитКомпоновщик.ПолучитьНастройки(); 
	
	УстановитьОтборыПоВариантуСверки(Настройки);

	ДанныеРасшифровкиОтчета = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровкиОтчета);
	
	ВнешнийНаборДанных = Новый Структура("ТаблицаРезультат", ТаблицаСверки);

	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных, ДанныеРасшифровкиОтчета);
	
	ДанныеРасшифровки = ПоместитьВоВременноеХранилище(ДанныеРасшифровкиОтчета, Новый УникальныйИдентификатор);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабличныйДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Элементы.ГруппаРезультатСверки.Доступность = Истина;
	ТекущийЭлемент =  Элементы.ГруппаРезультатСверки;
    
КонецПроцедуры

&НаСервере
Процедура ОбновитьТабДокНаСервере()
	
	РеквизитТаблицыСверки = ЭтотОбъект[ВариантСверки + "_ТаблицаСверки"];
	ТаблицаСверки = ПолучитьИзВременногоХранилища(РеквизитТаблицыСверки);
	ВывестиОтчетНаФорму(ТаблицаСверки);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыПоВариантуСверки(Настройки)
	
	Если ВариантСверки = "Взаиморасчеты" Тогда 
		УстановитьОтборыПоВариантуСверки_Взаиморасчеты(Настройки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСсылкуПоГУИД(Менеджер, сУИД)
	
	Если ЗначениеЗаполнено(сУИД) И сУИД <> "00000000-0000-0000-0000-000000000000" Тогда
		УИД = Новый УникальныйИдентификатор(сУИД); 
		Возврат Менеджер.ПолучитьСсылку(УИД);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СверкаВзаиморасчетов

&НаСервереБезКонтекста
Функция СписокДоступныхСчетов_Взаиморасчеты()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ХозрасчетныйВидыСубконто.Ссылка КАК Счет,
		|	МАКСИМУМ(ХозрасчетныйВидыСубконто.НомерСтроки) КАК НомерСтроки
		|ИЗ
		|	ПланСчетов.Хозрасчетный.ВидыСубконто КАК ХозрасчетныйВидыСубконто
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ХозрасчетныйВидыСубконто.НомерСтроки = 1
		|					И ХозрасчетныйВидыСубконто.ВидСубконто = &ВидСубконтоКонтрагентХозр
		|				ТОГДА ИСТИНА
		|			КОГДА ХозрасчетныйВидыСубконто.НомерСтроки = 2
		|					И ХозрасчетныйВидыСубконто.ВидСубконто = &ВидСубконтоДоговорХозр
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ХозрасчетныйВидыСубконто.Ссылка
		|
		|ИМЕЮЩИЕ
		|	МАКСИМУМ(ХозрасчетныйВидыСубконто.НомерСтроки) > 1";
	
	Запрос.УстановитьПараметр("ВидСубконтоДоговорХозр", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	Запрос.УстановитьПараметр("ВидСубконтоКонтрагентХозр", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	
	СписокСчетов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Счет");
	
	Возврат СписокСчетов;
	
КонецФункции

&НаСервере
Процедура ВыполнитьСверкуНаСервере_Взаиморасчеты(АдресХранилища)
	
	ТаблицаДанныхУПП = ПолучитьДанныеУПП_Взаиморасчеты(АдресХранилища);
	ТаблицаДанныхERP = ПолучитьДанныеERP_Взаиморасчеты();
	ТаблицаСверки = ТаблицаРезультатСверки_Взаиморасчеты(ТаблицаДанныхУПП, ТаблицаДанныхERP);
	Взаиморасчеты_ТаблицаСверки = ПоместитьВоВременноеХранилище(ТаблицаСверки, Новый УникальныйИдентификатор);

	ВывестиОтчетНаФорму(ТаблицаСверки);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеУПП_Взаиморасчеты(АдресХранилища) 
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресХранилища);
	ВремИмяФайла = ПолучитьИмяВременногоФайла(".xlsx");
	ДвоичныеДанные.Записать(ВремИмяФайла);
	
	ТабличныйДокументУПП = Новый ТабличныйДокумент;
	ТабличныйДокументУПП.Прочитать(ВремИмяФайла, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	Построитель = Новый ПостроительЗапроса;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабличныйДокументУПП.Область(1, 4, ТабличныйДокументУПП.ВысотаТаблицы, ТабличныйДокументУПП.ШиринаТаблицы));
	Построитель.Выполнить();
	ТаблицаДанныхУПП = Построитель.Результат.Выгрузить();
	
	ТаблицаДанныхУПП.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаДанныхУПП.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаДанныхУПП.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	
	Для Каждого СтрокаТаблицы Из ТаблицаДанныхУПП Цикл
		СтрокаТаблицы.Организация = ПолучитьСсылкуПоГУИД(Справочники.Организации, СтрокаТаблицы.Организация_GUID);
		СтрокаТаблицы.Контрагент = ПолучитьСсылкуПоГУИД(Справочники.Контрагенты, СтрокаТаблицы.Контрагент_GUID);
		СтрокаТаблицы.Договор = ПолучитьСсылкуПоГУИД(Справочники.ДоговорыКонтрагентов, СтрокаТаблицы.Договор_GUID);
	КонецЦикла;
	
	Возврат ТаблицаДанныхУПП;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеERP_Взаиморасчеты()
	
	ПараметрыДанныхERP = ПараметрыERP_Взаиморасчеты(); 
	ТаблицаДанныхERP = ТаблицаДанныхERP_Взаиморасчеты(ПараметрыДанныхERP, ДатаСверки);	
	Возврат ТаблицаДанныхERP;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТаблицаДанныхERP_Взаиморасчеты(ПараметрыСверки, ДатаСверки)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаСверки", Новый Граница(ДатаСверки));
	Запрос.УстановитьПараметр("СписокСчетов", ПараметрыСверки.ОтборПоСчетам);
	СубконтоКонтрагентыДоговоры = Новый Массив;
	СубконтоКонтрагентыДоговоры.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	СубконтоКонтрагентыДоговоры.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры); 
	Запрос.УстановитьПараметр("СубконтоКонтрагентыДоговоры", СубконтоКонтрагентыДоговоры);

	УсловияОтбора = Новый Массив;
	ЗначениеОтбора = Неопределено;
	
	Если ПараметрыСверки.Свойство("ОтборПоОрганизациям", ЗначениеОтбора) Тогда
		Запрос.УстановитьПараметр("Организации", ЗначениеОтбора);
		УсловияОтбора.Добавить("Организация В (&Организации)");
	КонецЕсли;
	
	Если ПараметрыСверки.Свойство("ОтборПоКонтрагентам", ЗначениеОтбора) Тогда
		Запрос.УстановитьПараметр("Контрагенты", ЗначениеОтбора);
		//НАЧАЛО Качикина 27.04.2026 Выполнение задач №000057272
		//УсловияОтбора.Добавить("Субконто1 В (&Контрагенты)");
		УсловияОтбора.Добавить("Субконто1 В (ВЫБРАТЬ втОтборПоКонтрагентам.Контрагент ИЗ втОтборПоКонтрагентам КАК втОтборПоКонтрагентам)"); 
		Запрос.УстановитьПараметр("ИспользоватьОтборПоКонтрагентам", Истина);
	Иначе
		Запрос.УстановитьПараметр("Контрагенты", Неопределено); 
		Запрос.УстановитьПараметр("ИспользоватьОтборПоКонтрагентам", Ложь);
		//КОНЕЦ Качикина 27.04.2026 Выполнение задач №000057272
	КонецЕсли;
	
	Если ПараметрыСверки.Свойство("ОтборПоДоговорам", ЗначениеОтбора) Тогда
		Запрос.УстановитьПараметр("Договоры", ЗначениеОтбора);
		УсловияОтбора.Добавить("Субконто2 В (&Договоры)");
	КонецЕсли;
	
	ТекстУсловий = "";
	Если УсловияОтбора.Количество() > 0 Тогда
		ТекстУсловий = СтрСоединить(УсловияОтбора, " И ");
	КонецЕсли;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//НАЧАЛО Качикина 27.04.2026 Выполнение задач №000057272 
        |	Контрагенты.Ссылка КАК Контрагент
		|ПОМЕСТИТЬ втОтборПоКонтрагентам
        |ИЗ
        |	Справочник.Контрагенты КАК Контрагенты
        |ГДЕ
        |	&ИспользоватьОтборПоКонтрагентам 
		|	И Контрагенты.Партнер В ИЕРАРХИИ(&Контрагенты)
	    |;
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//КОНЕЦ Качикина 27.04.2026 Выполнение задач №000057272
		|	ХозрасчетныйОстатки.Субконто1 КАК Контрагент,
		|	ХозрасчетныйОстатки.Субконто2 КАК Договор,
		|	ХозрасчетныйОстатки.СуммаОстатокДт КАК СуммаОстатокДт,
		|	ХозрасчетныйОстатки.СуммаОстатокКт КАК СуммаОстатокКт,
		|	ВЫБОР
		|		КОГДА ХозрасчетныйОстатки.Счет.Валютный
		|			ТОГДА ХозрасчетныйОстатки.ВалютнаяСуммаОстатокДт
		|		ИНАЧЕ ХозрасчетныйОстатки.СуммаОстатокДт
		|	КОНЕЦ КАК ВалютнаяСуммаОстатокДт,
		|	ВЫБОР
		|		КОГДА ХозрасчетныйОстатки.Счет.Валютный
		|			ТОГДА ХозрасчетныйОстатки.ВалютнаяСуммаОстатокКт
		|		ИНАЧЕ ХозрасчетныйОстатки.СуммаОстатокКт
		|	КОНЕЦ КАК ВалютнаяСуммаОстатокКт
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(&ДатаСверки, Счет В ИЕРАРХИИ (&СписокСчетов), &СубконтоКонтрагентыДоговоры, " + ТекстУсловий + " ) КАК ХозрасчетныйОстатки";
	

	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаРезультат;
	
КонецФункции

&НаСервере
Функция ПараметрыERP_Взаиморасчеты() 
	
	ПараметрыСверки = Новый Структура;
	
	СписокКонтрагентов = Взаиморасчеты_Контрагенты.ВыгрузитьЗначения();
	Если СписокКонтрагентов.Количество() > 0 Тогда
		ПараметрыСверки.Вставить("ОтборПоКонтрагентам", СписокКонтрагентов);   
	КонецЕсли; 
	СписокДоговоров = Взаиморасчеты_Договоры.ВыгрузитьЗначения();
	Если СписокДоговоров.Количество() > 0 Тогда
		ПараметрыСверки.Вставить("ОтборПоДоговорам", СписокДоговоров);
	КонецЕсли;
	СписокОрганизаций = Взаиморасчеты_Организации.ВыгрузитьЗначения();
	Если СписокОрганизаций.Количество() > 0 Тогда
		ПараметрыСверки.Вставить("ОтборПоОрганизациям", СписокОрганизаций);
	КонецЕсли;
	СписокСчетов = Взаиморасчеты_СчетаБУ.ВыгрузитьЗначения();
	Если СписокСчетов.Количество() > 0 Тогда
		ПараметрыСверки.Вставить("ОтборПоСчетам", СписокСчетов);
	Иначе
		ПараметрыСверки.Вставить("ОтборПоСчетам", Взаиморасчеты_СчетаБУ.ДоступныеЗначения.ВыгрузитьЗначения());
	КонецЕсли;
	
	Возврат ПараметрыСверки;
   
КонецФункции

&НаСервереБезКонтекста
Функция ТаблицаРезультатСверки_Взаиморасчеты(ТаблицаДанныхУПП, ТаблицаДанныхERP) 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаДанныхУПП", ТаблицаДанныхУПП);
	Запрос.УстановитьПараметр("ТаблицаДанныхERP", ТаблицаДанныхERP);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(ТаблицаДанныхУПП.Контрагент КАК Справочник.Контрагенты) КАК Контрагент,
		|	ТаблицаДанныхУПП.Договор КАК Договор,
		|	ТаблицаДанныхУПП.СальдоДтУпр КАК СальдоДтУпр,
		|	ТаблицаДанныхУПП.СальдоКтУпр КАК СальдоКтУпр,
		|	ТаблицаДанныхУПП.СальдоДтУпрВал КАК СальдоДтУпрВал,
		|	ТаблицаДанныхУПП.СальдоКтУпрВал КАК СальдоКтУпрВал
		|ПОМЕСТИТЬ ВТ_ДанныеУПП
		|ИЗ
		|	&ТаблицаДанныхУПП КАК ТаблицаДанныхУПП
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Контрагент,
		|	Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(ТаблицаДанныхERP.Контрагент КАК Справочник.Контрагенты) КАК Контрагент,
		|	ТаблицаДанныхERP.Договор КАК Договор,
		|	ТаблицаДанныхERP.СуммаОстатокДт КАК СуммаОстатокДт,
		|	ТаблицаДанныхERP.СуммаОстатокКт КАК СуммаОстатокКт,
		|	ТаблицаДанныхERP.ВалютнаяСуммаОстатокДт КАК ВалютнаяСуммаОстатокДт,
		|	ТаблицаДанныхERP.ВалютнаяСуммаОстатокКт КАК ВалютнаяСуммаОстатокКт
		|ПОМЕСТИТЬ ВТ_ДанныеERP
		|ИЗ
		|	&ТаблицаДанныхERP КАК ТаблицаДанныхERP
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Контрагент,
		|	Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВТ_ДанныеERP.Контрагент, ВТ_ДанныеУПП.Контрагент) КАК Контрагент,
		|	ЕСТЬNULL(ВТ_ДанныеERP.Договор, ВТ_ДанныеУПП.Договор) КАК Договор,
		|	ЕСТЬNULL(ВТ_ДанныеERP.СуммаОстатокДт, 0) КАК СальдоДтБУ,
		|	ЕСТЬNULL(ВТ_ДанныеERP.СуммаОстатокКт, 0) КАК СальдоКтБУ,
		|	ЕСТЬNULL(ВТ_ДанныеУПП.СальдоДтУпр, 0) КАК СальдоДтУУ,
		|	ЕСТЬNULL(ВТ_ДанныеУПП.СальдоКтУпр, 0) КАК СальдоКтУУ,
		|	ЕСТЬNULL(ВТ_ДанныеERP.ВалютнаяСуммаОстатокДт, 0) КАК СальдоДтВалБУ,
		|	ЕСТЬNULL(ВТ_ДанныеERP.ВалютнаяСуммаОстатокКт, 0) КАК СальдоКтВалБУ,
		|	ЕСТЬNULL(ВТ_ДанныеУПП.СальдоДтУпрВал, 0) КАК СальдоДтВалУУ,
		|	ЕСТЬNULL(ВТ_ДанныеУПП.СальдоКтУпрВал, 0) КАК СальдоКтВалУУ,
		|	ЕСТЬNULL(ВТ_ДанныеУПП.СальдоДтУпр, 0) - ЕСТЬNULL(ВТ_ДанныеERP.СуммаОстатокДт, 0) КАК РазницаСальдоДт,
		|	ЕСТЬNULL(ВТ_ДанныеУПП.СальдоКтУпр, 0) - ЕСТЬNULL(ВТ_ДанныеERP.СуммаОстатокКт, 0) КАК РазницаСальдоКт,
		|	ЕСТЬNULL(ВТ_ДанныеУПП.СальдоДтУпрВал, 0) - ЕСТЬNULL(ВТ_ДанныеERP.ВалютнаяСуммаОстатокДт, 0) КАК РазницаСальдоДтВал,
		|	ЕСТЬNULL(ВТ_ДанныеУПП.СальдоКтУпрВал, 0) - ЕСТЬNULL(ВТ_ДанныеERP.ВалютнаяСуммаОстатокКт, 0) КАК РазницаСальдоКтВал,
		|	ЕСТЬNULL(ЕСТЬNULL(ВТ_ДанныеERP.Контрагент.Партнер.Родитель, ВТ_ДанныеУПП.Контрагент.Партнер.Родитель), ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)) КАК ИерархияПартнера,
		|	ЕСТЬNULL(ВТ_ДанныеУПП.СальдоДтУпр, 0) - ЕСТЬNULL(ВТ_ДанныеERP.СуммаОстатокДт, 0) <> 0
		|		ИЛИ ЕСТЬNULL(ВТ_ДанныеУПП.СальдоКтУпр, 0) - ЕСТЬNULL(ВТ_ДанныеERP.СуммаОстатокКт, 0) <> 0
		|		ИЛИ ЕСТЬNULL(ВТ_ДанныеУПП.СальдоДтУпрВал, 0) - ЕСТЬNULL(ВТ_ДанныеERP.ВалютнаяСуммаОстатокДт, 0) <> 0
		|		ИЛИ ЕСТЬNULL(ВТ_ДанныеУПП.СальдоКтУпрВал, 0) - ЕСТЬNULL(ВТ_ДанныеERP.ВалютнаяСуммаОстатокКт, 0) <> 0 КАК ЕстьРазница
		|ИЗ
		|	ВТ_ДанныеУПП КАК ВТ_ДанныеУПП
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ДанныеERP КАК ВТ_ДанныеERP
		|		ПО ВТ_ДанныеУПП.Контрагент = ВТ_ДанныеERP.Контрагент
		|			И ВТ_ДанныеУПП.Договор = ВТ_ДанныеERP.Договор";
	
	РезультатСверки = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатСверки;
	
КонецФункции

&НаСервере
Процедура УстановитьОтборыПоВариантуСверки_Взаиморасчеты(Настройки)
	
	ПолеЕстьРазница = Новый ПолеКомпоновкиДанных("ЕстьРазница");
	Для Каждого ЭлементОтбора Из Настройки.Отбор.Элементы Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") 
			И ЭлементОтбора.ЛевоеЗначение = ПолеЕстьРазница Тогда
			
			ЭлементОтбора.Использование = Взаиморасчеты_ПоказыватьТолькоРасхождения;
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = Истина;
			
			Прервать; 
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти 

#КонецОбласти
